app/controllers/warehouses_controller.rb

  def index
    if user_signed_in?
      @warehouses = current_user.warehouses.includes(:warehouse_users)
---
SELECT "warehouse_users".* FROM "warehouse_users" WHERE "warehouse_users"."warehouse_id" = 1 AND "warehouse_users"."user_id" = 7 LIMIT 1
SELECT "warehouses".* FROM "warehouses" INNER JOIN "warehouse_users" ON "warehouses"."id" = "warehouse_users"."warehouse_id" WHERE "warehouse_users"."user_id" = 7