app/views/warehouses/index.html.erb

SELECT "warehouses".* FROM "warehouses" INNER JOIN "warehouse_users" ON "warehouses"."id" = "warehouse_users"."warehouse_id" WHERE "warehouse_users"."user_id" = 7
SELECT "warehouse_users".* FROM "warehouse_users" WHERE "warehouse_users"."warehouse_id" = 1 AND "warehouse_users"."user_id" = 7 LIMIT 1
---
              <h2 class="text-xl font-semibold text-gray-900"><%= warehouse.name %></h2>
              <% wu = warehouse.warehouse_users.find_by(user: current_user) %>